# Напишите программу, которая будет на вход вещественное число и показывать первую цифру после запятой.

n = float(input())
print (int(n*10%10))